import type { FC, ReactNode } from 'react'
import { Container } from './style'

interface Iprops {
  children?: ReactNode
}
const Footer: FC<Iprops> = () => {
  return (
    <>
      <Container>
        <div className="content">
          <h3>
            {' '}
            ◊◊有资格的购买人在活动地点购买符合条件的产品并搭配促销产品时，可享促销优惠金额。每个有资格的购买人购买符合条件的产品时，仅限搭配购买一件促销产品。优惠活动视供应状况而定。需遵守此处列出的条款和条件。
          </h3>
          <h3>
            ∇ 仅限 Apple Store 零售店
            (上海)。有关国家补贴活动的实施规则、具体补贴资格、适用地区和日期，均须遵守政府实时政策。请注意：分配的国家补贴资金一旦使用完毕，则无法提供国家补贴，届时你可能无法用国家补贴券进行下单。符合资格的消费者购买参与活动的
            iPhone、iPad、Apple Watch 时，可享商品到手价基础上再立减 15%
            的国家补贴，每件补贴不超过 500 元，仅限到手价不超过 6000
            元的单件商品；购买参与活动的 Mac 时，可享商品到手价基础上再立减 20%
            的国家补贴，每件补贴不超过 2000
            元。参与国家补贴活动的产品范围可能因政策要求等原因进行调整。实际补贴金额以商品购买页面展示为准。参与国家补贴的订单不支持与
            iPhone 年年焕新计划、Apple Trade In 换购计划或 AppleCare+
            服务计划同时下单购买。参与国家补贴的订单不支持部分退款，不支持换货，不支持保价退差。
          </h3>
          <h3>
            Apple Store 零售店：于上海地区 Apple Store
            零售店参与活动的消费者必须出示身份证件，提供姓名，用以按要求开具个人实名信息的发票。此外，于北京地区
            Apple Store
            零售店参与活动的消费者必须输入身份证号、手机号码等个人信息，用以核实消费者和补贴资格领用者为同一人并绑定补贴资格，该等信息由银联商务支付股份有限公司北京分公司收集和处理。上述信息将依法留存以供有关部门核查和审计。参与国家补贴的
            Apple Store
            零售店订单不支持部分付款方式，不支持定制化服务。参与国家补贴的 Apple
            Store
            零售店订单，购买后需在门店配合工作人员完成现场拆封、激活及拍照存档等国家补贴政策所要求的操作。如不能在购买当场完成激活或配合拍照存档等操作，则无法享受国家补贴。完整活动规则详见
            apple.com.cn/promo。
          </h3>
          <h3>《鸣潮》于 2025 年初推出 macOS 版。</h3>
          <h3>
            1. 折抵换购服务由 Apple
            的折抵服务合作伙伴提供。折抵金额报价仅为预估价，实际折抵金额可能低于预估价值，具体金额取决于设备的状况、配置、推出年份，以及发售国家或地区。并非所有设备均有资格获得第三方折抵服务合作伙伴提供的设备折抵金额或
            Apple 提供的购新优惠。年满 18
            周岁及以上者才可参与本计划。现有设备的折抵金额可用于折抵购买新的
            Apple
            设备。实际折抵金额取决于收到的符合折抵条件的设备情况是否与评估报价时你提供的设备描述相符合。可能需按照新设备的全额售价缴纳销售税。店内折抵需出示政府颁发并附有照片的有效身份证件
            (当地法律可能会要求存储该信息)。该服务可能仅在部分 Apple Store
            零售店提供，在线换购和店内换购的折抵金额可能有所不同。某些 Apple
            Store 零售店可能有不同要求。Apple
            的折抵服务合作伙伴保留出于任何原因拒绝、取消任何折抵交易或限制任何设备
            (及其数量) 的权利。如需获得有关折抵及设备回收服务的更多信息，请咨询
            Apple 的折抵服务合作伙伴。需要遵守 Apple
            的折抵服务合作伙伴的其他条款。
          </h3>
          <h2>2. 分期付款服务的条件</h2>
          <h3>
            上述所示分期付款金额仅为使用特定期数免息分期付款估算得出的示例
            (仅显示整数数额，未显示小数点以后的金额)，实际支付金额以银行或花呗账单为准。上述分期付款方案由信用卡发卡机构招商银行、中国建设银行、中国工商银行以及蚂蚁金服
            (花呗) 面向符合条件的中国大陆居民提供。Apple Store
            零售店的分期付款方案可能与 Apple Store 在线商店不同，请到店咨询
            Specialist 专家。北京和上海地区参与国家补贴的 Apple Store
            零售店订单不支持分期付款。所有购物分期均需经你的信用卡发卡机构批准，对于花呗分期，需经蚂蚁金服批准。如果你选择的分期付款方案未获得信用卡发卡机构或蚂蚁金服的批准，Apple
            将不会被告知原因。请参阅招商银行、中国建设银行、中国工商银行和支付宝网站，了解相关条件、费用和收费。订单可能需要满足特定金额要求，不同免息分期期数对应的最低限额可能有所不同。上述分期付款服务只适用于个人消费者。企业和教育机构客户、企业员工购买计划
            (EPP) 和 Apple 员工购买计划 (EPP)
            适用的分期付款方案可能与上述方案不同，详情请参见教育商店、EPP
            在线商店和企业商店。公司信用卡无资格申请分期。招商银行分期付款单笔订单最高限额为
            RMB 150000。
          </h3>
          <h3>
            当商品有货并/或发货时，购物金额将计入你的信用卡或支付宝账户账单。相关财务费用将显示在你的信用卡对账单或支付宝账户中。
          </h3>
          <h3>
            产品按广告宣传价或标价提供分期付款服务。价格包含增值税。所有订单均可享受免费送货服务。
          </h3>
          <h3>此信息更新于 2025 年 7 月 1 日。</h3>
          <h3>
            ∆∆
            三小时为根据过往物流数据推算的预估时间，特殊情况下可能会延迟。该服务由第三方合作伙伴提供，需额外支付运费，且仅适用于部分商品和寄送地址，具体以结账页面为准。如果之后选择退货，运费将不会被退回。
          </h3>
          <h3>
            ** 须遵守数量限制。参阅{' '}
            <a
              style={{ textDecoration: 'underline' }}
              href="https://www.apple.com.cn/cn/shop/browse/open/salespolicies/edu"
            >
              Apple 销售及退款政策
            </a>
            ，了解全部条款和条件。
          </h3>
          <h3>
            *** 使用 iCloud 至少需要安装 iOS 10 的 iPhone 5、iPod touch
            (第六代)、iPad (第四代) 或 iPad mini 2；安装 watchOS 3 的 Apple
            Watch；安装 macOS Sierra 10.12 的 Mac；安装 tvOS 4 的 Apple TV
            (第四代)；安装 visionOS 1 的 Apple Vision Pro；或安装 Windows 11
            或更新系统的 PC (要访问电子邮件、通讯录和日历，需使用 Outlook 2019
            或更新版本，或最新版本的浏览器)。某些功能要求使用 iOS 16、iPadOS 16
            和 macOS
            Ventura。某些功能要求使用无线网络连接。某些功能仅适用于部分国家或地区。某些服务仅限
            10 部设备进行访问。
          </h3>
          <h3>°° 仅限高校学生。需要通过验证。</h3>
          <h3>
            我们会使用你所在位置，为你更快显示送货选项。我们通过你的 IP
            地址，或者你在上次访问 Apple 网站时输入的位置信息，找到了你的位置。
          </h3>
        </div>
      </Container>
    </>
  )
}
export default Footer
